app/Controllers/Controle.php

            "idUsuario" => $session->idUsuario
        ];

        $resposta = $gastoModel->save($dados);
---
INSERT INTO `gasto` (`data`, `valor`, `idTipoGasto`, `idFormaPagamento`, `descricao`, `parcelado`, `numeroParcelas`, `idUsuario`) VALUES ('2022-08-29', '1,00', '3', '1', 'Almoço', 1, '10', '1')