app/Controllers/Entrada.php

    public function create()
    {
        $validacao = $this->validate([
            "dataEntrada" => "required",
            "valor" => "required"
        ]);

        if (!$validacao) {
            return view("entrada/novo", [
                "validation" => $this->validator,
            ]);
        }

        $entradaModel = new EntradaModel();
        $session = session();

        $dados = [
            "dataEntrada" => $this->request->getPost("dataEntrada"),
            "valor" => str_replace(",", ".", str_replace(".", "", $this->request->getPost("valor"))),
        ];

        $resposta = $entradaModel->save($dados);
---
INSERT INTO `entrada` (`dataEntrada`, `valor`) VALUES ('2022-08-20', '9400.00')