app/Controllers/TipoGasto.php

    public function create()
    {
        $validacao = $this->validate([
            "descricao" => "required"
        ]);

        if (!$validacao) {
            return view("tipoGasto/index", [
                "validation" => $this->validator
            ]);
        }

        $tipoGastoModel = new TipoGastoModel();

        $dados = [
            "descricao" => $this->request->getPost("descricao")
        ];

        if($tipoGastoModel->save($dados)) {
---
INSERT INTO `tipoGasto` (`descricao`) VALUES ('ttt')