app/Models/DadosBancariosModel.php

    public function getPorUsuario($id) {
        return $this
                ->where("idUsuario", $id)
                ->where("ativo", 1)
                ->orderBy("banco")
                ->get()
                ->getResult();
---
SELECT *
FROM `dadoBancario`
WHERE `idUsuario` = '1'
AND `ativo` = 1
ORDER BY `banco`

    public function remove($id) {
        return $this->update(["idDadoBancario" => $id], ["ativo" => 0]);
---
UPDATE `dadoBancario` SET `ativo` = 0
WHERE `dadoBancario`.`idDadoBancario` IN ('1')