app/Models/FormaPagamentoModel.php

    public function selectList() {
        $result = $this
                    ->select("idFormaPagamento, descricao")
                    ->where("ativo", 1)
                    ->get()
                    ->getResult();
---
SELECT `idFormaPagamento`, `descricao`
FROM `formaPagamento`
WHERE `ativo` = 1