app/Models/GastoModel.php

SELECT SUM(valor) as valor
FROM `gasto`
WHERE `data` >= '2022-08-10'
AND `data` <= '2022-09-10'
 LIMIT 1
---
    public function somaValor() {
        $session = session();

        $periodo = $session->get("periodos");

        return $this->select("SUM(valor) as valor", false)
                    ->where("data >=", $periodo["dataInicio"])
                    ->where("data <=", $periodo["dataFim"])
                    ->first();