app/Models/TipoGastoModel.php

SELECT *
FROM `tipoGasto`
WHERE `ativo` = 1
ORDER BY `descricao`
---
    public function getLista()
    {
        return $this
                ->where("ativo", 1)
                ->orderBy("descricao")
                ->get()
                ->getResult();

SELECT `idTipoGasto`, `descricao`
FROM `tipoGasto`
WHERE `ativo` = 1
---
    public function selectList() {
        $result = $this
                    ->select("idTipoGasto, descricao")
                    ->where("ativo", 1)
                    ->get()
                    ->getResult();

UPDATE `tipoGasto` SET `ativo` = 0
WHERE `idTipoGasto` = '8'
---
    public function remove($id) {
        $this->builder()->set("ativo", 0)->where("idTipoGasto", $id)->update();