app/Models/UsuarioModel.php

    public function login($dados) {
        $usuario = $this->where("email", $dados["email"])->where("senha", $this->hashValue($dados["senha"]))->first();
---
SELECT *
FROM `usuario`
WHERE `email` = 'deividson.sgkft@gmail.com'
AND `senha` = '3c9909afec25354d551dae21590bb26e38d53f2173b8d3dc3eee4c047e7ab1c1eb8b85103e3be7ba613b31bb5c9c36214dc9f14a42fd7a2fdb84856bca5c44c2'
 LIMIT 1

    public function create($dados) {
        $dados["senha"] = $this->hashValue($dados["senha"]);
        return $this->save($dados);
---
INSERT INTO `usuario` (`email`, `senha`, `nome`) VALUES ('deividson.sgkft@gmail.com', '3c9909afec25354d551dae21590bb26e38d53f2173b8d3dc3eee4c047e7ab1c1eb8b85103e3be7ba613b31bb5c9c36214dc9f14a42fd7a2fdb84856bca5c44c2', 'Deividson Oliveira dos Santos')